Artillery.yml
config:
  target: 'http://localhost:3002'
  processor: "./myrandom.js"
  phases:
    - duration: 3
      arrivalRate: 1
scenarios:
  - weight: 0/100
    name: "GET Listing"
    flow:
    - get:
        url: "/listing/{{ $randomNumber(1,10000000) }}"
  - weight: 100/100
    name: "POST Listing"
    flow:
      - function: 'generateData'
      - post:
          url: "/listing/"
          json:
            city: "{{ city }}"
            title: "{{ title }}"
            numberOfGuests: "{{ numberOfGuests }}"
            isGreatLocation: "{{ isGreatLocation }}"
            description: "{{ description }}"